# קלוט מספרים מהמשתמש עד שמתקבל רצף של 3 מספרים עוקבים שעולים (כל אחד גדול מהקודם)
#
# דוגמה לרצף קלט אפשרי: 1 0 1 1 2 2 3- 8 7 9 11
#
# במקרה הזה התוכנית תסתיים כי התקבל הרצף 7 9 11
#
# רמז:
#
# שמור את המספר הקודם במשתנה
# בכל פעם שהמספר החדש גדול מהקודם – הגדל מונה ב־1
# אחרת – אפס את המונה חזרה ל־1
# עצור את הלולאה כאשר המונה מגיע ל־3

cnt = 1
cur = None
while True:
    num: int = int(input("Enter a number: "))
    if cur is None:
        cur = num
    else:
        if num > cur:
            cnt += 1
        else:
            cnt = 1
        cur = num
    if cnt == 3:
        break
